server/loadtest/loadtest.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    pool: 1
  phases:
    - duration: 1
      arrivalCount: 15000
      name: "Warm up the application"
  payload:
      # path is relative to the location of the test script
      path: "../csv/tweets.csv"
      fields:
        - "tweetid"
      path: "../csv/tweets.csv"
      fields:
        - "tweet"
scenarios:
  - flow:
    - get:
        url: "/interactors/{{tweet}}"