server/loadtest/loadtest.yml
config:
  target: 'http://localhost:3000'
  http:
    pool: 1
  phases:
    - duration: 10
      arrivalCount: 100
      name: "Warm up the application"
  payload:
      # path is relative to the location of the test script
      path: "../csv/tweets.csv"
      fields:
        - "id"
scenarios:
  - flow:
    - get:
        url: "/interactors/{{ id }}"