server/loadtest/loadtest.yml
config:
  target: 'http://127.0.0.1:3000'
  http:
    pool: 1
  phases:
    - duration: 10
      arrivalCount: 1000
      name: "Warm up the application"
  payload:
      # path is relative to the location of the test script
      path: "../csv/tweets.csv"
      fields:
        - "tweetid"
      path: "../csv/ids.csv"
      fields:
        - "user"
scenarios:
  - flow:
    - get:
        url: "/interactors/z2uws8sgjbi6b9qb"